/* package up error # */
"error %1$d" = "erro %1$d";
"error %1$#x" = "erro %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Erro deconhecido: 0";

/* errno error 1 */
"Operation not permitted" = "Operação não permitida";

/* errno error 2 */
"No such file or directory" = "Ficheiro ou directório inexistente";

/* errno error 3 */
"No such process" = "Processo inexistente";

/* errno error 4 */
"Interrupted system call" = "Chamada de sistema interrompida";

/* errno error 5 */
"Input/output error" = "Erro de entrada/saída";

/* errno error 6 */
"Device not configured" = "Periférico não configurado";

/* errno error 7 */
"Argument list too long" = "Lista do argumentos demasiado grande";

/* errno error 8 */
"Exec format error" = "Erro no formato do executável";

/* errno error 9 */
"Bad file descriptor" = "Descritor de ficheiro inválido";

/* errno error 10 */
"No child processes" = "Processos de nível inferior inexistentes";

/* errno error 11 */
"Resource deadlock avoided" = "Bloqueio do recurso evitado";

/* errno error 12 */
"Cannot allocate memory" = "Impossível alocar memória";

/* errno error 13 */
"Permission denied" = "Permissão negada";

/* errno error 14 */
"Bad address" = "Endereço inválido";

/* errno error 15 */
"Block device required" = "Periférico do bloco requerido";

/* errno error 16 */
"Resource busy" = "Recurso em utilização";

/* errno error 17 */
"File exists" = "Ficheiro existente";

/* errno error 18 */
"Cross-device link" = "Cross-device link";

/* errno error 19 */
"Operation not supported by device" = "Operação não suportada pelo periférico";

/* errno error 20 */
"Not a directory" = "Não é um directório";

/* errno error 21 */
"Is a directory" = "É um directório";

/* errno error 22 */
"Invalid argument" = "Argumento inválido";

/* errno error 23 */
"Too many open files in system" = "Demasiados ficheiros abertos no sistema";

/* errno error 24 */
"Too many open files" = "Demasiados ficheiros abertos";

/* errno error 25 */
"Inappropriate ioctl for device" = "Controlo de entrada/saída inapropriado para periférico";

/* errno error 26 */
"Text file busy" = "Ficheiro de texto ocupado";

/* errno error 27 */
"File too large" = "Ficheiro demasiado grande";

/* errno error 28 */
"No space left on device" = "Não existe mais espaço no periférico";

/* errno error 29 */
"Illegal seek" = "Pesquisa ilegal";

/* errno error 30 */
"Read-only file system" = "Sistema de ficheiro apenas para leitura";

/* errno error 31 */
"Too many links" = "Demasiadas ligações";

/* errno error 32 */
"Broken pipe" = "Ligação interrompida";

/* errno error 33 */
"Numerical argument out of domain" = "Argumento numérico fora do domínio";

/* errno error 34 */
"Result too large" = "Resultado muito grande";

/* errno error 35 */
"Resource temporarily unavailable" = "Recurso temporariamente indisponível";

/* errno error 36 */
"Operation now in progress" = "Operação agora em curso";

/* errno error 37 */
"Operation already in progress" = "Operação já em curso";

/* errno error 38 */
"Socket operation on non-socket" = "Operação socket em non-socket";

/* errno error 39 */
"Destination address required" = "Endereço de destino requerido";

/* errno error 40 */
"Message too long" = "Mensagem demasiado comprida";

/* errno error 41 */
"Protocol wrong type for socket" = "Tipo errado de protocolo para socket";

/* errno error 42 */
"Protocol not available" = "Protocolo não disponível";

/* errno error 43 */
"Protocol not supported" = "Protocolo não suportado";

/* errno error 44 */
"Socket type not supported" = "Tipo de socket não suportado";

/* errno error 45 */
"Operation not supported" = "Operação não suportada";

/* errno error 46 */
"Protocol family not supported" = "Família de protocolo não suportado";

/* errno error 47 */
"Address family not supported by protocol family" = "Família de endereço não suportada pela família de protocolo";

/* errno error 48 */
"Address already in use" = "Endereço já em utilização";

/* errno error 49 */
"Can't assign requested address" = "Impossível atribuir o endereço requerido";

/* errno error 50 */
"Network is down" = "A rede está inactiva";

/* errno error 51 */
"Network is unreachable" = "A rede está indisponível";

/* errno error 52 */
"Network dropped connection on reset" = "A rede interrompeu a ligação ao reinicializar";

/* errno error 53 */
"Software caused connection abort" = "O software interrompeu a ligação";

/* errno error 54 */
"Connection reset by peer" = "Ligação reinicializada pelo par";

/* errno error 55 */
"No buffer space available" = "Sem espaço disponível no buffer";

/* errno error 56 */
"Socket is already connected" = "Socket já está ligado";

/* errno error 57 */
"Socket is not connected" = "Socket desligado";

/* errno error 58 */
"Can't send after socket shutdown" = "Impossível enviar após desligar o socket";

/* errno error 59 */
"Too many references: can't splice" = "Demasiadas referências: impossível unir";

/* errno error 60 */
"Operation timed out" = "Terminou o tempo disponível para esta operação";

/* errno error 61 */
"Connection refused" = "Ligação recusada";

/* errno error 62 */
"Too many levels of symbolic links" = "Demasiadas níveis de ligações simbólicas";

/* errno error 63 */
"File name too long" = "Nome do ficheiro muito grande";

/* errno error 64 */
"Host is down" = "O host está inactivo";

/* errno error 65 */
"No route to host" = "Acesso ao host inexistente";

/* errno error 66 */
"Directory not empty" = "Directório não vazio";

/* errno error 67 */
"Too many processes" = "Demasiados processos";

/* errno error 68 */
"Too many users" = "Demasiados utilizadores";

/* errno error 69 */
"Disc quota exceeded" = "Quota do disco excedida";

/* errno error 70 */
"Stale NFS file handle" = "Handle do ficheiro NFS caducado";

/* errno error 71 */
"Too many levels of remote in path" = "Demasiados níveis de ligações remotas no percurso";

/* errno error 72 */
"RPC struct is bad" = "Estrutura RPC inválida";

/* errno error 73 */
"RPC version wrong" = "Versão RPC errada";

/* errno error 74 */
"RPC prog. not avail" = "Prog. RPC não disp.";

/* errno error 75 */
"Program version wrong" = "Versão do programa errada";

/* errno error 76 */
"Bad procedure for program" = "Procedimento inválido para o programa";

/* errno error 77 */
"No locks available" = "Protecções indisponíveis";

/* errno error 78 */
"Function not implemented" = "Função não implementada";

/* errno error 79 */
"Inappropriate file type or format" = "Tipo ou formato de ficheiro inapropriado";

/* errno error 80 */
"Authentication error" = "Erro de autenticação";

/* errno error 81 */
"Need authenticator" = "Necessário autenticador";

/* errno error 82 */
"Device power is off" = "A alimentação do periférico está desligada";

/* errno error 83 */
"Device error" = "Erro no periférico";

/* errno error 84 */
"Value too large to be stored in data type" = "Valor muito grande para ser armazenado no tipo de dados";

/* errno error 85 */
"Bad executable (or shared library)" = "Executável (ou biblioteca partilhada) inválido";

/* errno error 86 */
"Bad CPU type in executable" = "Tipo de CPU inválido no executável";

/* errno error 87 */
"Shared library version mismatch" = "Versão incompatível de biblioteca partilhada";

/* errno error 88 */
"Malformed Mach-o file" = "Ficheiro Mach-o inválido";

/* errno error 89 */
"Operation canceled" = "Operação cancelada";

/* errno error 90 */
"Identifier removed" = "Identificador removido";

/* errno error 91 */
"No message of desired type" = "Messagem inexistente";

/* errno error 92 */
"Illegal byte sequence" = "Sequência de bytes inválida";

/* errno error 93 */
"Attribute not found" = "Atributo não encontrado";

/* errno error 94 */
"Bad message" = "Mensagem inválida";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (Reservado)";

/* errno error 96 */
"No message available on STREAM" = "Mensagens indisponível em STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (Reservado)";

/* errno error 98 */
"No STREAM resources" = "Recursos STREAM inexistentes";

/* errno error 99 */
"Not a STREAM" = "STREAM inexistente";

/* errno error 100 */
"Protocol error" = "Erro de protocolo";

/* errno error 101 */
"STREAM ioctl timeout" = "Tempo STREAMSTREAM do controlo de entrada/saída excedido";

/* errno error 102 */
"Operation not supported on socket" = "Operação não suportada no socket";

/* errno error 103 */
"Policy not found" = "Política não encontrada";
